In [1]:
sub_list = ['math', 'english', 'science', 'history']
score_list = [87, 94, 85, 92]
Fscore_list = [i + 4 for i in score_list]

In [3]:
import pandas as pd

df2 = pd.DataFrame([score_list, Fscore_list], index = ['M_scr', 'F_scr'], columns = sub_list)
df2

       math  english  science  history
M_scr    87       94       85       92
F_scr    91       98       89       96

In [4]:
df2['math']

M_scr    87
F_scr    91
Name: math, dtype: int64

In [5]:
df2[['math']]

       math
M_scr    87
F_scr    91

In [6]:
df2['science']

M_scr    85
F_scr    89
Name: science, dtype: int64

In [8]:
df2.loc['M_scr']

math       87
english    94
science    85
history    92
Name: M_scr, dtype: int64

In [9]:
df2.loc[['M_scr']]

       math  english  science  history
M_scr    87       94       85       92

In [10]:
df2.reset_index(inplace = True)

In [11]:
df2

   index  math  english  science  history
0  M_scr    87       94       85       92
1  F_scr    91       98       89       96

In [12]:
df2.reset_index()

   level_0  index  math  english  science  history
0        0  M_scr    87       94       85       92
1        1  F_scr    91       98       89       96

In [17]:
df2

   index  math  english  science  history
0  M_scr    87       94       85       92
1  F_scr    91       98       89       96

In [18]:
df2.reset_index()

   level_0  index  math  english  science  history
0        0  M_scr    87       94       85       92
1        1  F_scr    91       98       89       96

In [19]:
df2['level_0']

KeyError: 'level_0'

In [20]:
df2

   index  math  english  science  history
0  M_scr    87       94       85       92
1  F_scr    91       98       89       96

In [21]:
df2.reset_index(inplace = True)

In [22]:
df2

   level_0  index  math  english  science  history
0        0  M_scr    87       94       85       92
1        1  F_scr    91       98       89       96

In [23]:
df2['level_0']

0    0
1    1
Name: level_0, dtype: int64

In [24]:
del df2['level_0']

In [25]:
df2

   index  math  english  science  history
0  M_scr    87       94       85       92
1  F_scr    91       98       89       96

In [27]:
df2.rename(columns = {'index': 'sem'}, inplace = True)
df2

     sem  math  english  science  history
0  M_scr    87       94       85       92
1  F_scr    91       98       89       96

In [31]:
df2.rename(index = {'0': '1', '1': '2'}, inplace = True)

In [32]:
df2

     sem  math  english  science  history
0  M_scr    87       94       85       92
1  F_scr    91       98       89       96

In [35]:
df2.index

Int64Index([0, 1], dtype='int64')

In [36]:
df2.index = ['ind1', 'ind2']

In [37]:
df2

        sem  math  english  science  history
ind1  M_scr    87       94       85       92
ind2  F_scr    91       98       89       96

In [38]:
df2.set_index('sem', inplace = True)

In [39]:
df2

       math  english  science  history
sem
M_scr    87       94       85       92
F_scr    91       98       89       96